Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_179-Teaching_The_Relative_and_Ultimate_Truths-v1.tmx
Source language: bo
Languages: en

source: ཀུན་རྫོབ་ཏུ་ན་བསྟན་པ་ནི་ཟད་མི་ཤེས།
en: relatively, their teaching knows no exhaustion,

source: དྲན་པ་ནི་རྒྱ་མཚོ་དང་འདྲ།
en: their mindfulness is like the ocean,

source: ཏིང་ངེ་འཛིན་ནི་རི་རབ་དང་མཚུངས།
en: their absorption is comparable to the central mountain,

source: བཟོད་པ་ནི་ས་དང་འདྲའོ། །
en: and their patience is like the earth.

source: ཀུན་རྫོབ་ཏུ་ན་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་སེལ་བའི་ཕྱིར་དཔའ་བའོ། །
en: “Relatively, they are courageous when it comes to clearing away all thoughts;

source: མི་ཤེས་པའི་མུན་པ་མུན་ནག་སེལ་བའི་ཕྱིར་ཉི་མ་ལྟ་བུའོ། །
en: they shine like the sun to dispel the deep darkness of ignorance;

source: རབ་ཏུ་སྣང་བའི་ཕྱིར་ཟླ་བ་དང་འདྲའོ། །
en: they shine like the moon in order to illuminate the world.

source: ཀུན་རྫོབ་ཏུ་ན་འདུ་བའི་ཕྱིར་དབང་པོ་དང་མཚུངས་སོ། །
en: Relatively, they are like a ruler in order to attract others.

source: ཀུན་རྫོབ་ཏུ་ན་སེམས་ལ་དབང་བྱེད་པའི་ཕྱིར་ཚངས་པ་དང་འདྲའོ། །
en: Relatively, they are like Brahmā in order to master the mind.

source: ཀུན་རྫོབ་ཏུ་ན་ནམ་མཁའ་ལ་དབང་བྱེད་པའི་ཕྱིར་མི་མཉམ་པ་དང་མཉམ་པའོ། །
en: Relatively, they are incomparable in order to master space.

source: ཀུན་རྫོབ་ཏུ་ན་ཐམས་ཅད་རྗེས་སུ་སོང་ཡང་དོན་དམ་པར་ན་གང་དུ་སོང་བའམ་འོངས་པའམ། འདུག་པ་མེད་དོ། །
en: Relatively they have followed, but ultimately there is no one who goes, comes, or remains.

source: དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མ་བྱུང་བའི་ཕྱིར་རོ། །
en: Because ultimately all phenomena are utterly unarisen.

source: ལྷའི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་དེ་དང་འདྲ་སྟེ།
en: “Divine son, such is the spiritual community of hearers belonging to the Blessed, thus-gone, worthy, perfect Buddha Ratnaketu.

source: དེ་བས་ཀྱང་ལྷག་པར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆོས་དང་ཡང་ལྡན་ནོ། །
en: Moreover, the dharma that they possess is even more inconceivable than that.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་མི་དམིགས་པའི་ཚུལ་གྱིས་བསྟན་པ་འདི་བཤད་པ་ན་
en: When Mañjuśrī Kumārabhuta delivered this teaching in a manner beyond reference points,

source: དགེ་སློང་ལྔ་བརྒྱ་དང་།
en: five hundred monks,

source: དགེ་བསྙེན་ལྔ་བརྒྱ་དང་།
en: five hundred laypeople,

source: ལྷའི་བུ་ལྔ་སྟོང་དམིགས་པ་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: and five thousand gods who held reference points all made this supplication:

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་ཏོག་དེའི་ཉན་ཐོས་སུ་གྱུར་ཅིག །
en: “Blessed One, may we also become hearers belonging to the Blessed, thus-gone, worthy, perfect Buddha Ratnaketu.”

source: ཀྱེ་གྲོགས་པོ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དམིགས་པ་ཅན་ཐམས་ཅད་མི་སྐྱེའོ། །
en: My friends, only bodhisattva great beings who are free from reference points are born there without being born.

source: ཀྱེ་གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམིགས་པ་མེད་པ་རྣམས་ནི་མི་སྐྱེ་བའི་ཚུལ་གྱིས་དེར་སྐྱེའོ། །
en: My friends, if you aspire to that realm, you must strive in the perfection of knowledge in a manner free from reference points.

source: ཀྱེ་གྲོགས་པོ་དག་གལ་ཏེ་ཁྱེད་ཀྱང་དེར་འདོད་ན་ཁྱེད་ཀྱིས་མི་དམིགས་པའི་ཚུལ་གྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: My friends, when you strive in the perfection of knowledge in a manner that is free from reference points,

source: ཀྱེ་གྲོགས་པོ་དག་ཁྱེད་ནམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་བརྩོན་པར་གྱུར་པ་དེའི་ཚེ། གྲོགས་པོ་དག་ཁྱེད་ལ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ།
en: then, my friends, it will not be difficult to discover omniscient wisdom that is endowed with the supreme of all aspects.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱང་རྙེད་པར་མི་དཀའ་ན། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྐྱེ་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: So what need is there to mention that you will also be born in the pure buddha realms!”

source: ལྷའི་བུ་རབ་ཏུ་ཞི་བ་རྣམ་པར་དུལ་བའི་དབང་ཕྱུག་གིས་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The god Lord of Peace and Calm then asked Mañjuśrī Kumārabhuta,

source: འཇམ་དཔལ་ཉན་ཐོས་ཀྱི་འདུལ་བ་ནི་ཇི་ལྟ་བུ།
en: “Mañjuśrī, what is the vinaya of the hearers like?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བ་ནི་ཇི་ལྟ་བུ།
en: And how is the vinaya of the bodhisattva great beings?”

source: ལྷའི་བུ་ཁམས་གསུམ་གྱིས་སྐྲག་པས་བཏུལ་བ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “Divine son, the vinaya that is well known in the three worlds is the vinaya of the hearers.

source: དགེ་བའི་རྩ་བའི་ཚོགས་ཐམས་ཅད་བསགས་ཤིང་སེམས་ཅན་ཐམས་ཅད་དབུགས་འབྱིན་པ་དང་། ཁམས་གསུམ་དུ་བསམས་བཞིན་དུ་སྐྱེ་བས་བཏུལ་བ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, on the relative level, the vinaya of the bodhisattva great beings gathers all accumulations of roots of virtue, comforts all beings, and tames them by taking birth in the three realms.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ལ་སྡང་བ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers opposes all disturbing emotions.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤོང་བའི་ཕྱིར་རྗེས་སུ་བཏུལ་བ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings goes further in order to eliminate the disturbing emotions of all beings.

source: ཕྱོགས་གཅིག་རིག་པ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers is aware of just one place.

source: ཕྱོགས་བཅུ་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རིག་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings is aware of all the limitless and boundless worlds in the ten directions.

source: བདུད་ཐམས་ཅད་ལ་བཏང་སྙོམས་པ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers maintains equanimity with regard to all demons.

source: ཕྱོགས་བཅུ་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་བདུད་ཀྱི་རིགས་ཐམས་ཅད་དཀྲུགས་ཤིང་། ཕྱིར་རྒོལ་བ་ཐམས་ཅད་འཇོམས་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings disturbs all classes of demons in all the limitless and boundless worlds in the ten directions, and conquers all hostile forces.

source: བདག་གི་རྒྱུད་གསལ་བར་བྱེད་པ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers clarifies one’s own mind stream.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱུད་གསལ་བར་བྱེད་ཅིང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སྣང་བར་བྱེད་པ་དང་།
en: the vinaya of the bodhisattva great beings clarifies the mind streams of all beings, causes the wisdom of omniscience to manifest,

source: ཆོས་ཐམས་ཅད་ལ་བསྒྲིབས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་སྣང་བར་བྱེད་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, and causes the vision of stainless wisdom with regard to all phenomena to manifest.

source: རང་གི་སེམས་ཀྱིས་བསམས་པ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers is contemplated by individual minds.

source: འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་གྱི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དགོངས་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings is the intent of all the buddhas in the past, the present, and the future.

source: རྡོ་ཆག་པའི་འཕྲོ་མི་འབྱོར་པ་ལྟ་བུ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers is like a stone that cannot be repaired when broken.

source: གསེར་དང་། དངུལ་ཆག་པའི་འཕྲོ་འབྱོར་པ་ལྟ་བུ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings is like gold and silver, which can be mended when broken.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། ཐབས་མཁས་པ་དང་བྲལ་བ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers does not contain all the teachings of the Buddha, and it also lacks skillful means.

source: ཐབས་མཁས་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དུ་བསྡུ་བས་བསྡུས་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings has great skillful means and comprises all the teachings of the Buddha.

source: སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། མ་འདྲེས་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་བྲལ་བ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers does not embody the ten strengths, the various types of fearlessness, the unique qualities, or omniscient wisdom.

source: སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། མ་འདྲེས་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་བསྡུ་བས་བསྡུས་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings contains the ten powers, the various types of fearlessness, the unique qualities, and omniscient wisdom.

source: མེས་ཚིག་པ་ལས་འབྲོས་པ་ལྟ་བུ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers is like escaping from being burned by a fire.

source: སྐྱེད་མོས་ཚལ་དང་། གཞལ་མེད་ཁང་ལྟ་བུར་ཆོས་ཀྱི་དགའ་བས་དགའ་བ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings is to be delighted by the joy of Dharma, just as one would enjoy a park or a palace.

source: བག་ཆགས་ཀྱི་རྒྱུན་མ་ཆད་པ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “The vinaya of the hearers does not interrupt the stream of habitual patterns.

source: བག་ཆགས་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings overcomes all habitual patterns.

source: ལྷའི་བུ་མདོར་ན་ཚད་དུ་གཏོགས་པ་ཚད་ཀྱི་ཆོས་ཀྱིས་དྲངས་པ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: “Divine son, in short, the vinaya of the hearers is derived from a Dharma that is limited and confined.

source: ཚད་དུ་གཏོགས་པ་མ་ཡིན་པ་ཚད་མེད་པའི་ཆོས་ཀྱིས་དྲངས་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བའོ། །
en: However, relatively, the vinaya of the bodhisattva great beings follows a Dharma that is limitless and beyond measure.

source: ཚད་ཡོད་པའི་ཚུལ་ཁྲིམས་དང་།
en: “The vinaya of the hearers brings the attainment of limited discipline,

source: ཐོས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཐོབ་པར་བྱེད་པ་ནི་ཉན་ཐོས་ཀྱི་འདུལ་བའོ། །
en: learning, absorption, knowledge, liberation, and vision of the wisdom of liberation.

source: ཚད་མེད་པའི་ཡོན་ཏན་དང་ལྡན་ཞིང་། ཚད་ཡོད་པ་མ་ཡིན་པ།
en: possesses limitless qualities,

source: ཚད་མེད་པའི་ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་།
en: and makes one attain limitless discipline, learning, absorption, knowledge, liberation,

source: རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཐོབ་པར་བྱེད་པ་ནི་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པར་གྲོལ་བའོ། །
en: and vision of the wisdom of liberation.” However, relatively, the vinaya of the bodhisattva great beings knows no bounds,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ། །ཞེས་བྱ་བ་བྱིན་ཏེ།
en: At this point, the Blessed One expressed his approval of Mañjuśrī Kumārabhuta: “Well said, Mañjuśrī!

source: འཇམ་དཔལ་ཁྱོད་ཀྱིས་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་འདུལ་བ་ལེགས་པར་བཤད་པ་ལེགས་སོ་ལེགས་སོ། །
en: You have explained the vinaya of the bodhisattva great beings well on the relative level. Well done, well done.

source: འཇམ་དཔལ་ཡང་འདི་ལྟར་དོན་དེ་ཉིད་བསྟན་པའི་ཕྱིར་ཁྱོད་ལ་དཔེ་བསྟན་ཏོ། །
en: Now, Mañjuśrī, in order to illustrate the meaning of this, I will give you some examples.

source: འཇམ་དཔལ་འདི་ལྟ་སྟེ།
en: Mañjuśrī,

source: དཔེར་ན་སྐྱེས་བུ་གཉིས་ཤིག་ཡོད་ལ། དེ་ལས་སྐྱེས་བུ་གཅིག་ནི་བ་ལང་གི་རྗེས་ཀྱི་བསྔགས་པ་སྨྲ།
en: imagine two men: one of them praises the hoofprints of an ox,

source: སྐྱེས་བུ་གཅིག་ནི་རྒྱ་མཚོ་ཆེན་པོའི་བསྔགས་པ་སྨྲ་ན།
en: while the other man praises the ocean.

source: འཇམ་དཔལ་དེ་ཇི་སྙམ་དུ་སེམས།
en: Mañjuśrī, what do you think?

source: སྐྱེས་བུ་དེས་བ་ལང་གི་རྗེས་ཀྱི་བསྔགས་པ་ཇི་སྙེད་ཅིག་བརྗོད་ནུས།
en: How extensively would the first man be able to praise the hoofprints of an ox?”

source: བཅོམ་ལྡན་འདས་བ་ལང་གི་རྗེས་ཐམས་ཅད་ཀྱང་ཆུང་ན།
en: “Blessed One, since all ox hoofprints are so small,

source: དེའི་བསྔགས་པ་ལྟ་ཅི་སྨོས།
en: what is even the use of praising them?”

source: འཇམ་དཔལ་དེ་བཞིན་དུ་བ་ལང་གི་རྗེས་ཆུང་བ་ལྟར་ཉན་ཐོས་ཀྱི་འདུལ་བར་བལྟའོ། །
en: “Just as the ox hoofprints are small, so you should view the vinaya of the hearers.

source: འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Now, Mañjuśrī, what do you think?

source: སྐྱེས་བུ་ཅིག་ཤོས་དེས་རྒྱ་མཚོ་ཆེན་པོའི་བསྔགས་པ་ཇི་ཙམ་ཞིག་བརྗོད་ནུས།
en: Would the other man be able to express a fitting praise of the ocean?”

source: བཅོམ་ལྡན་འདས་རྒྱ་མཚོ་ཆེན་པོའི་བསྔགས་པ་ནི་ཤིན་ཏུ་མང་སྟེ།
en: “Blessed One, the praises of the ocean could be incredibly numerous,

source: དཔག་ཏུ་མ་མཆིས།
en: limitless,

source: བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: and inconceivable.”

source: འཇམ་དཔལ་དེ་བཞིན་དུ་རྒྱ་མཚོ་ཆེན་པོའི་བསྔགས་པ་དཔག་ཏུ་མེད་པ་ལྟར་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བར་བལྟའོ། །
en: “Mañjuśrī, just as the praises of the ocean are boundless, so you should view the vinaya of the bodhisattvas on the relative level.”

source: དེ་ནས་བསྟན་པ་འདི་མི་སྟོན་པའི་ཚུལ་གྱིས་བཤད་པ་ན་
en: As he delivered this teaching without teaching,

source: ལྷའི་བུ་ཁྲི་ཉིས་སྟོང་གིས་དོན་དམ་པར་ན་མ་སྐྱེས་པའི་ཚུལ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་ནས་
en: 12,000 gods, without ultimately forming anything, formed the wish for unexcelled and completely perfect awakening.

source: ཚིག་འདི་སྐད་ཅེས་ཀྱང་སྨྲ་སྟེ།
en: They all declared,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་འདི་ལ་མི་སློབ་པའི་ཚུལ་གྱིས་སློབ་བོ། །
en: “Blessed One, without training, we will practice the trainings of the bodhisattvas.”

source: ཅི་འཇམ་དཔལ་ཁྱོད་ཉན་ཐོས་ཀྱི་འདུལ་བ་ལ་བསླབས་སམ།
en: “Mañjuśrī, do you train in the vinaya of the hearers

source: འོན་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་འདུལ་བ་ལ་བསླབས།
en: or in the vinaya of the bodhisattvas?”

source: ལྷའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Divine son, what do you think?

source: རྒྱ་མཚོ་ཆེན་པོར་མི་ཤོང་བའི་ཆུ་གང་ཡང་ཡོད་དམ།
en: Is there any water that cannot be contained in the ocean?”

source: འཇམ་དཔལ་རྒྱ་མཚོ་ཆེན་པོར་མི་ཤོང་བའི་ཆུ་གང་ཡང་མེད་དོ། །
en: “No, Mañjuśrī, there is no water anywhere that cannot be contained in the ocean.”

source: ལྷའི་བུ་དེ་བཞིན་དུ་ཀུན་རྫོབ་ཏུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུལ་བ་ནི་རྒྱ་མཚོ་ཆེན་པོ་དང་འདྲའོ། །
en: “Divine son, in the same way the vinaya of the bodhisattva great beings is like the ocean.”

source: འཇམ་དཔལ་འདུལ་བ་འདུལ་བ་ཞེས་བྱ་བའི་ཚིག་གི་དོན་གང་ཡིན།
en: “Mañjuśrī, that word vinaya, what does that mean?”

source: ལྷའི་བུ་ཉོན་མོངས་པ་འདུལ་བ་ནི་ཀུན་རྫོབ་ཏུ་ན་འདུལ་བའོ། །
en: “Divine son, on the relative level vinaya refers to taming the disturbing emotions.

source: ཉོན་མོངས་པ་ཡོངས་སུ་ཤེས་པའང་འདུལ་བའོ། །
en: Vinaya also means understanding disturbing emotions.”

source: འཇམ་དཔལ་ཇི་ལྟར་ན་ཉོན་མོངས་པ་འདུལ་བར་འགྱུར།
en: “Mañjuśrī, how does one tame the disturbing emotions?

source: ཇི་ལྟར་ན་ཉོན་མོངས་པ་ཡོངས་སུ་ཤེས་པ་ཡིན།
en: How does one understand disturbing emotions?”

source: དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་མ་བྱུང་མ་སྐྱེས་དངོས་པོ་མེད་པ་ཡིན་ན་ཀུན་རྫོབ་ཏུ་མེད་པ་ལ་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་ཏེ།
en: “Ultimately, all phenomena are unborn, unarisen, and unreal. Yet this absence is misunderstood on the relative level.

source: མེད་པ་ལས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་དེ་ལས་ཀུན་ཏུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པའོ། །
en: Misunderstanding this absence produces concepts and thoughts.

source: ཀུན་ཏུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དེ་ལས་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པའོ། །
en: Out of concept and thought appears mistaken conceptual activity.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དེ་ལས་བདག་ཏུ་སྒྲོ་འདོགས་པའོ། །
en: Mistaken conceptual activity then gives rise to the superimposition of a self.

source: བདག་ཏུ་སྒྲོ་འདོགས་པ་དེ་ལས་ལྟ་བ་ཀུན་ནས་ལྡང་བའོ། །
en: From the superimposition of a self comes the manifestation of views.

source: ལྟ་བ་ཀུན་ནས་ལྡང་བ་དེ་ལས་ཉོན་མོངས་པ་རྣམས་འབྱུང་ངོ་། །
en: Based on the manifestation of views, disturbing emotions appear.

source: གང་ཡང་ལྷའི་བུ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མ་སྐྱེས་མ་བྱུང་དངོས་པོ་མེད་པར་མི་ཤེས་པའི་ཚུལ་གྱིས་རབ་ཏུ་ཤེས་པ་དེ་ནི་དོན་དམ་པར་ན་ཕྱིན་ཅི་མ་ལོག་པའོ། །
en: “Divine son, whoever knows, without knowing, that ultimately all phenomena are utterly unborn, utterly unarisen, and utterly unreal, is unmistaken in terms of the ultimate.

source: གང་དོན་དམ་པར་ན་ཕྱིན་ཅི་མ་ལོག་པ་དེ་ནི་རྟོག་པ་མེད་ཅིང་རྣམ་པར་མི་རྟོག་པའོ། །
en: Whoever is unmistaken in terms of the ultimate does not form concepts or thoughts.

source: གང་རྟོག་པ་མེད་ཅིང་རྣམ་པར་མི་རྟོག་པ་དེ་ནི་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་བའོ། །
en: Whoever does not form concepts or thoughts is applying himself correctly.

source: གང་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་བ་དེ་ལ་དོན་དམ་པར་ན་བདག་ཏུ་སྒྲོ་འདོགས་པ་མི་འབྱུང་ངོ་། །
en: Whoever applies himself correctly does not ultimately form superimpositions of a self.

source: གང་ལ་དོན་དམ་པར་ན་བདག་ཏུ་སྒྲོ་འདོགས་པ་མི་འབྱུང་བ་དེ་ལ་ལྟ་བ་ཀུན་ནས་ལྡང་བར་མི་འགྱུར་བ་ནས་དོན་དམ་པར་ན་མྱ་ངན་ལས་འདས་པར་ལྟ་བ་ཀུན་ནས་ལྡང་བར་ཡང་མི་འགྱུར་ཏེ།
en: When superimpositions of a self do not ultimately arise, manifest views also do not arise, and ultimately even the views related to passing beyond suffering do not arise.

source: དེ་ལྟར་མ་སྐྱེས་པ་ལ་སྤྱོད་པ་དེ་ནི་ཉོན་མོངས་པ་ཤིན་ཏུ་རྣམ་པར་དུལ་བར་མི་ལྟ་བའི་ཚུལ་གྱིས་བགྱི་སྟེ།
en: In that way one comes to experience the unborn, and pacifies disturbing emotions in a manner free from views.

source: ལྷའི་བུ་འདི་ནི་ཉོན་མོངས་པ་འདུལ་བ་ཞེས་བྱའོ། །
en: Divine son, this is what is meant by taming disturbing emotions.

source: ལྷའི་བུ་ནམ་ཉོན་མོངས་པ་རྣམས་ལ་སྣང་བ་མེད་པའི་ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱིས་དོན་དམ་པར་ན་ཤིན་ཏུ་སྟོང་པ་དང་། ཤིན་ཏུ་མཚན་མ་མེད་པ་དང་། ཤིན་ཏུ་སྨོན་པ་མེད་དོ། །
en: “Divine son, disturbing emotions are ultimately utterly empty, utterly signless and utterly wishless due to the insight and wisdom to which no disturbing emotions ever appear.

source: དོན་དམ་པར་ན་ཤིན་ཏུ་མ་སྐྱེས་མ་བྱུང་།
en: When one has the insight that ultimately they are utterly unborn, utterly unarisen,

source: དངོས་པོ་མེད་པར་མི་ཤེས་པའི་ཚུལ་གྱིས་རབ་ཏུ་ཤེས་ན།
en: and utterly unreal,

source: ལྷའི་བུ་དེའི་ཚེ་མི་ཤེས་པའི་ཚུལ་གྱིས་ཉོན་མོངས་པ་རྣམས་ཡོངས་སུ་ཤེས་པ་ཡིན་ནོ། །
en: then, divine son, one knows disturbing emotions in a manner free from knowing.

source: དཔེར་ན་སྦྲུལ་ཁ་གདུག་པའི་རིག་སྔགས་འདོན་པ་དེས་ནི་སྦྲུལ་ཁ་གདུག་པའི་གདུག་པ་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །
en: If you chant an incantation against a viper’s venom, it is possible to neutralize the snake’s poison.

source: ལྷའི་བུ་དེ་བཞིན་དུ་གང་ཉོན་མོངས་པ་རྣམས་ཀྱི་རིགས་རབ་ཏུ་ཤེས་པ་དེའི་ཉོན་མོངས་པ་རྣམས་ཤིན་ཏུ་མི་དམིགས་པའི་ཚུལ་གྱིས་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: Divine son, in the same way, whoever understands the types of disturbing emotions will neutralize his disturbing emotions in a manner that is beyond reference points.”

source: འཇམ་དཔལ་ཉོན་མོངས་པའི་རིགས་དེ་གང་ཡིན།
en: “Mañjuśrī, what are the types of disturbing emotions?”

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་མ་སྐྱེས་མ་བྱུང་།
en: “Divine son, ultimately all phenomena are utterly unborn, utterly unarisen, and utterly unreal.

source: དངོས་པོ་མེད་པ་ལ་གང་ཀུན་ཏུ་རྟོག་པ་དེ་ནི་ཉོན་མོངས་པ་རྣམས་ཀྱི་རིགས་སོ། །
en: Any conceptualization of that state is a form of disturbing emotion.

source: དོན་དམ་པར་ན་ཀུན་ཏུ་མི་རྟོག་པའི་ཕྱིར་ཀུན་ནས་ཉོན་མི་མོངས་སོ། །
en: Ultimately, there are no conceptualizations, so therefore there are also no disturbing emotions whatsoever.

source: ལྷའི་བུ་ཀུན་ནས་ཉོན་མོངས་པས་ཀུན་གཞི་མེད་དོ། །
en: Divine son, because there are no disturbing emotions, there is no all-ground.

source: ཀུན་གཞི་མེད་པས་དོན་དམ་པར་ན་མི་གནས་སོ། །
en: Because there is no all-ground, there is ultimately no abiding.

source: མི་གནས་པས་དོན་དམ་པར་མི་འཚིག་གོ །
en: Because there is no abiding, there is ultimately no scorching.

source: མི་འཚིག་པས་དོན་དམ་པར་ན་ཉེ་བར་ཞི་བ་ཞེས་བྱའོ། །
en: Because there is ultimately no scorching, there is said to be peace.

source: དོན་དམ་པར་ན་ཇི་སྐད་སྨྲས་པ་བཞིན་དུ་ནི་མ་ཡིན་ཏེ།
en: On the ultimate level, things are not as they are expressed in words.

source: ལྷའི་བུ་ཀུན་རྫོབ་ཏུ་ན་འདི་ནི་ཉོན་མོངས་པ་འདུལ་བའོ། །
en: Still, divine son, relatively this is how disturbing emotions are tamed.”

source: འཇམ་དཔལ་ཇི་ལྟར་ན་ཉོན་མོངས་པ་རྣམས་འདུལ་བར་འགྱུར།
en: “Mañjuśrī, how are disturbing emotions tamed?

source: ཅི་ཡོད་པ་ཞིག་གམ།
en: Are they something?

source: འོན་ཏེ་མེད་པ་ཞིག །
en: Or nothing?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ་ལྷའི་བུ་འདི་ལྟ་སྟེ།
en: Mañjuśrī said, “Divine son, this is how it is.

source: དཔེར་ན་སྐྱེས་བུ་ཞིག་གཉིད་ཀྱིས་ལོག་པའི་རྨི་ལམ་ལ་སྦྲུལ་ཁ་གདུག་པས་ཟིན་ནས་དེ་སྡུག་བསྔལ་གྱིས་གཙེ་བ་ལས་
en: Imagine a man who has a nightmare in which he is bitten by a venomous viper.

source: ཡང་དུག་སྨན་བཏང་ནས། དེའི་གདུག་པ་མེད་པར་གྱུར་ཏེ།
en: Although he is suffering, he is treated with an antidote and recovers.

source: གདུག་པ་མེད་པར་གྱུར་པས་སྡུག་བསྔལ་ཡང་མེད་པར་གྱུར་ན།
en: As the poison is neutralized, his pain disappears.

source: སྐྱེས་བུ་དེ་ཡང་དག་པར་ཟིན་ཏམ་འོན་ཏེ་ཡང་དག་པ་མ་ཡིན།
en: Was this man actually bitten or not?”

source: འཇམ་དཔལ་དོན་དམ་པར་ན་ཤིན་ཏུ་ཡང་དག་པ་མ་ཡིན་ནོ། །
en: “Mañjuśrī, ultimately it did not truly happen.”

source: ལྷའི་བུ་ཇི་ལྟར་དུག་དེ་མེད་པར་འགྱུར།
en: “Divine son, how was the poison neutralized?”

source: འཇམ་དཔལ་ཇི་ལྟར་ཟིན་པ་ཤིན་ཏུ་མི་བདེན་པ་དེ་བཞིན་དུ་དུག་མེད་པར་གྱུར་པ་ཡང་ཤིན་ཏུ་བདེན་པ་མ་ཡིན་ནོ། །
en: “Mañjuśrī, just as the bite was not truly real, the neutralization of the poison was also not truly real.”

source: ལྷའི་བུ་དེ་བཞིན་དུ་འཕགས་པ་རྣམས་ཀྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་དོན་དམ་པར་མི་བལྟ་བའི་ཚུལ་གྱིས་བལྟའོ། །
en: “Divine son, in the same way the noble ones view, without viewing, all disturbing emotions on the ultimate level.

source: ལྷའི་བུ་གང་ཡང་འདི་སྐད་དུ་ཇི་ལྟར་ན་ཉོན་མོངས་པ་རྣམས་འདུལ་བར་འགྱུར་ཞེས་ཟེར་བ་ནི་
en: Divine son, you ask how disturbing emotions are tamed.

source: ལྷའི་བུ་ཇི་ལྟར་བདག་དོན་དམ་པར་ན་བདག་མེད་པ་དེ་བཞིན་དུ་ལྷའི་བུ་དོན་དམ་པར་ན་ཉོན་མོངས་པ་རྣམས་ཀྱང་ཉོན་མོངས་པ་རྣམས་མ་ཡིན་ནོ། །
en: Well, divine son, just as the ego ultimately is egoless, so, divine son, disturbing emotions are not ultimately disturbing emotions.

source: ལྷའི་བུ་དེ་སྟེ་དོན་དམ་པར་ན་བདག་དེ་བཞིན་ཉིད་ཡིན་ན་ནི་
en: Divine son, ultimately this self is suchness.

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཉོན་མོངས་པ་ཡང་དེ་བཞིན་ཉིད་དུ་འགྱུར་རོ། །
en: Therefore, divine son, disturbing emotions also ultimately become suchness.

source: ལྷའི་བུ་འདི་ལྟར་བདག་དོན་དམ་པར་ན་བདག་མ་ཡིན་ཏེ།
en: Divine son, in this way, the self is not ultimately the self.

source: ལྷའི་བུ་དེ་བས་ན་ཉོན་མོངས་པ་རྣམས་ཀྱང་དོན་དམ་པར་ན་ཉོན་མོངས་པ་མ་ཡིན་ནོ། །
en: Therefore, divine son, disturbing emotions are also not ultimately disturbing emotions.

source: ལྷའི་བུ་དེ་ལ་གང་གི་དོན་དམ་པར་ཉོན་མོངས་པ་འདུལ་བར་དམིགས་པར་འགྱུར་བ་ནི་དོན་དམ་པར་ན་གང་ཡང་མི་དམིགས་སོ། །
en: Divine son, whoever focuses on taming disturbing emotions on the ultimate level is not ultimately focusing on anything.

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཤིན་ཏུ་མ་བྱུང་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཞི་བའོ། །
en: Divine son, because on the ultimate level nothing manifests, and therefore all phenomena are pacified.

source: ལྷའི་བུ་དོན་དམ་པར་ན་འཛིན་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཉེ་བར་ཞི་བའོ། །
en: Divine son, on the ultimate level, there is no grasping, and therefore all phenomena are fully pacified.

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཆོས་ཐམས་ཅད་སྒྲོ་བཏགས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རབ་ཏུ་ཞི་བའོ། །
en: Divine son, on the ultimate level, all phenomena are free from superimposition, and therefore all phenomena are completely pacified.

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཤིན་ཏུ་མ་སྐྱེས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མི་ཟད་པའོ། །
en: Divine son, on the ultimate level, all phenomena are utterly unborn, and therefore they are also beyond ceasing.

source: ལྷའི་བུ་དོན་དམ་པར་ན་ཤིན་ཏུ་དངོས་པོ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་མ་སྐྱེས་པའོ། །
en: Divine son, the ultimate level is utterly unreal and therefore all phenomena are utterly unborn.”

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་གང་ཡིན།
en: “Mañjuśrī, what is the gateway to all dharmas?”

source: ལྷའི་བུ་སྨྲ་བར་བྱ་བ་དང་། སྨྲ་བ་དང་ཤེས་པ་དང་། ཤེས་པར་བྱ་བ་དང་བྱ་བ་དང་ཐ་སྙད་དང་། བྱེད་པ་ཐམས་ཅད་འཇུག་པའི་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྒོའོ། །
en: “Divine son, the relative truth, which employs all forms of statements, speech, cognition, objects of cognition, activities, conventions, and acts, is a gateway to all dharmas.
